#Задача «Замена подстроки»
s = input()
print(s.replace("1", "one"))