#Задача «Замена подстроки»
print(input().replace("1","one"))